{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.0.1", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "caption_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 20], "dtype": "float32", "sparse": false, "name": "caption_input"}, "inbound_nodes": []}, {"name": "image_embedding_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 2048], "dtype": "float32", "sparse": false, "name": "image_embedding_input"}, "inbound_nodes": []}, {"name": "embedding_with_glove", "class_name": "Embedding", "config": {"name": "embedding_with_glove", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 6309, "output_dim": 200, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "inbound_nodes": [[["caption_input", 0, 0, {}]]]}, {"name": "image_dropout", "class_name": "Dropout", "config": {"name": "image_dropout", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["image_embedding_input", 0, 0, {}]]]}, {"name": "caption_dropout", "class_name": "Dropout", "config": {"name": "caption_dropout", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["embedding_with_glove", 0, 0, {}]]]}, {"name": "image_bottleneck", "class_name": "Dense", "config": {"name": "image_bottleneck", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["image_dropout", 0, 0, {}]]]}, {"name": "caption_lstm", "class_name": "LSTM", "config": {"name": "caption_lstm", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 256, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["caption_dropout", 0, 0, {}]]]}, {"name": "add", "class_name": "Add", "config": {"name": "add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["image_bottleneck", 0, 0, {}], ["caption_lstm", 0, 0, {}]]]}, {"name": "decoder_dense", "class_name": "Dense", "config": {"name": "decoder_dense", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add", 0, 0, {}]]]}, {"name": "output", "class_name": "Dense", "config": {"name": "output", "trainable": true, "dtype": "float32", "units": 6309, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["decoder_dense", 0, 0, {}]]]}], "input_layers": [["image_embedding_input", 0, 0], ["caption_input", 0, 0]], "output_layers": [["output", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1.0000000116860974e-07, "amsgrad": false}}, "loss": "categorical_crossentropy", "metrics": ["categorical_accuracy"], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of4.bin", "group1-shard2of4.bin", "group1-shard3of4.bin", "group1-shard4of4.bin"], "weights": [{"name": "caption_lstm/kernel", "shape": [200, 1024], "dtype": "float32"}, {"name": "caption_lstm/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "caption_lstm/bias", "shape": [1024], "dtype": "float32"}, {"name": "decoder_dense/kernel", "shape": [256, 256], "dtype": "float32"}, {"name": "decoder_dense/bias", "shape": [256], "dtype": "float32"}, {"name": "embedding_with_glove/embeddings", "shape": [6309, 200], "dtype": "float32"}, {"name": "image_bottleneck/kernel", "shape": [2048, 256], "dtype": "float32"}, {"name": "image_bottleneck/bias", "shape": [256], "dtype": "float32"}, {"name": "output/kernel", "shape": [256, 6309], "dtype": "float32"}, {"name": "output/bias", "shape": [6309], "dtype": "float32"}]}]}